{"posts": {"1": {"body": "<p>                    <a href=\"https://discourse-cdn-sjc1.com/eveonline/uploads/default/original/3X/8/9/89fafbb5dbcc2342c7f02f699484830f1b175227.jpeg\" target=\"_blank\" class=\"onebox\" rel=\"nofollow noopener\">\n            <img src=\"https://discourse-cdn-sjc1.com/eveonline/uploads/default/original/3X/8/9/89fafbb5dbcc2342c7f02f699484830f1b175227.jpeg\" width=\"690\" height=\"388\">\n          </a>\n\n</p>\n<p>Yesterday we <a href=\"https://www.eveonline.com/article/pp1a3f/2019-03-28-14-00-utc-forum-ama-with-ccp-hellmar-ceo-of-ccp\" rel=\"nofollow noopener\">announced a live AMA</a> with CCP Hellmar, CEO of CCP Games.</p>\n<p>Now it’s happening, live!</p>\n<p><a href=\"https://forums.eveonline.com/t/2019-03-28-14-00-utc-forum-ama-with-ccp-hellmar-ceo-of-ccp/148877\">Discussion kicked off in this thread along with gathering of initial questions.</a></p>\n<p>The initial questions from yesterday’s thread have been answered and are in a post below this one, so feel free to dive into them, then ask any more questions you like!</p>\n<p>If you’d like to discuss the AMA, <a href=\"https://forums.eveonline.com/t/2019-03-28-14-00-utc-forum-ama-with-ccp-hellmar-ceo-of-ccp/148877\">please keep discussion to the other thread</a> so that we can keep this one clear for questions and answers!</p>", "username": "CCP_Falcon", "name": "CCP Falcon", "likes": 3, "id": 895267, "postedDate": 1553781005000}, "2": {"body": "<h2><strong>Does CCP have any data to show whether Alpha clones contribute anything to the game or the company?</strong></h2>\n<p>Since the introduction of Alpha clones with Ascension we’ve seen a lot more players dip into New Eden who are EVE curious but don’t want to commit to paying a subscription until they know what they’re getting into.</p>\n<p>Alpha clones have been great for exposing EVE to a far wider audience and giving people the chance to try it out without any commitments.</p>\n<p>More people in New Eden means more content, so they’re good for both the company, and for EVE.</p>\n<p>Concretely we are attracting about the same number of new players to EVE this year as we did back in 2013 which was the peak year under mandatory subscription. Open access has had a profound impact on the growth trajectory of EVE, even if we have a lot of work to do to maximize the real potential.</p>\n<h2><strong>In which concrete/precise ways does the purchase by PA help development of Eve?</strong></h2>\n<p>There’s a wealth of ways in which the purchase of CCP benefits both companies.</p>\n<p>Both CCP and Pearl Abyss have incredibly strong IPs, super dedicated communities and the same love for creating virtual worlds and kick ass games.</p>\n<p>For CCP, ownership by Pearl Abyss brings more stability than ever before and a sense of belonging to something great. It’s far healthier for a gaming company to be owned by gamers rather than a consortium of investors who just want to see return on investment at the end of the year.</p>\n<p>It lets us plan more long term and think in more detail about the health of EVE. This results in us making better decisions for the health of the game rather than trying to appease investors who don’t necessarily understand gaming. Similarly, Pearl Abyss can learn from CCP on how to make their solid foundations of a game go into two decades and more of continuous service and community activity.</p>\n<p>In addition, Pearl Abyss provides CCP with easier access to the incredibly hardcore Korean MMO market – for example, we’ve recently announced Korean localization will be coming to EVE Online before the end of the year.</p>\n<p>There is also a lot of knowledge share happening between both companies. Both us learning from them and sharing our findings and I have personally found that sharing some of the magic of EVE makes us as a company understand and appreciate it on a much deeper level as some of it is quite profound and unique and deep discussions with another accomplished MMO developer will enable us to dig deeper into that.</p>\n<h2><strong>Are there any plans of having a PROPER companion app for eve?</strong></h2>\n<p>We have some plans in the works and have been deploying teams on it, but at this stage we’re still scoping things out and doing the initial development work. You’ll be hearing more about this for sure though and there’ll be multiple releases in 2019!</p>\n<h2><strong>What mind-blowing tech innovations for Eve can we expect in 2019?</strong></h2>\n<p>Right now, we’re focusing on the core of EVE, making sure that we get rid of as much technical debt as we possibly can that’s built up over the course of the last twenty years or so.</p>\n<p>It’s going to be pretty cool to see POS code finally be given a Viking funeral and the move to a 64-bit client is going to help client stability a lot, especially in large fights.</p>\n<p>The move to DirectX12 will unlock more performance on modern hardware but also overall hardware as we will be streamlining and modernizing a lot of 3D engine code at the same time. This will also bring the ability to explore space phenomena which was previously not possible with our existing engine code and graphics APIs. Things like, large scale asteroid fields, Kuiper belt, ort cloud, Saturn rings, etc. were not possible due to graphics engine constraints. Once we finish the upgrade, these are topics we will have the ability to explore, doesn’t mean we will do all those but great to build capabilities like that that enable a much richer future for EVE.</p>\n<p>I am personally loving the relationship we are building with Hadean, it’s generating profound learning on both sides and the problems we are trying to tackle are some of the biggest in gaming from a tech standpoint and EVE is really the only world that is pushing up against those boundaries.</p>\n<p>It’s all about futureproofing and cleaning house this year, making sure that we’re paying the right attention in the right places, so that we have an even better foundation than ever before to do great things as we head toward the 20th anniversary of EVE.</p>\n<h2><strong>How are you planning to improve situation with gate/mining/station ganking?</strong></h2>\n<p>This is probably more a question for our game designers than me, but I guess I can chime in with opinion.</p>\n<p>Emergent gameplay is a beautiful thing, and that’s what EVE is all about. It’s about taking off the leash and letting people have fun in a sandbox. There are few core rules in EVE, and a couple of them are to make sure you’re insured, never fly what you can’t afford to lose and never put all your eggs in one basket.</p>\n<p>EVE is meant to be a cruel world, but it is also meant to be a fair playground to some extent. Just like we saw with the changes to wardecs, where we had a situation where a few bullies were having fun at the expense of tens of thousands, exploiting a game design that had been stagnant for too long. Then we do need to intervene when we have concrete data.</p>\n<p>EVE still needs to stay dark, risky and dangerous both for good and bad, sometimes it’s just not risky for the bad.</p>\n<h2><strong>What are the plans for Faction Warfare?</strong></h2>\n<p>We’ve started to revisit a few old systems in the last few years including POS (with their replacement, citadels), Wardecs (with the changes you’re seeing starting to roll out now) and PI (with the overhaul of the UX we ran in 2017/2018).</p>\n<p>Factional Warfare has a lot of potential and could be great gateway to introduce new players to conflict in EVE. I recently heard that a few members of the community have set up a Factional Warfare discussion discord and I’m interested to see what conversations happen there.</p>\n<p>It’d be nice to put some focus on FW down the road, but it’s not currently on a roadmap right now.</p>\n<h2><strong>What’s the current vision in development for eve as a product now that the acquisition is settling in, and as a universe?</strong></h2>\n<p>The vision for the EVE Universe remains unchanged. It’s always been a goal for us that we’re working toward creating a virtual world that’s the greatest and largest living work of science fiction.</p>\n<p>True, our journey to this destination hasn’t always been a straight line, but this is part of the process when you’re setting out to create something unprecedented. From every setback, we learn and become stronger.</p>\n<p>We’re super confident now that we’ve entered a really solid period of focus on EVE that will result in some seriously exciting developments in the not-too-distant future. We’ll get things done, even if I sometimes wish it could be smoother ride.</p>\n<h2><strong>What about the state of gambling? You banned games of chances, but introduced mutaplasmids and abyssal pvp, which is a form of gambling.</strong></h2>\n<p>Most people could see what institutions like SomerBlink and IWANTISK were doing to the economy and political landscape of EVE.</p>\n<p>It wasn’t a good direction and after EULA related issues with one of the organizations and the fact that the other was neck deep in RMT on a massive scale, we decided to intervene.</p>\n<p>Using a random number generator to randomize stats on a module within a game client is fundamentally different to an unregulated third-party service using the EVE Online IP to operate gambling websites, especially when they start delving into RMT.</p>\n<p>Games of chance operated by third parties using the EVE IP are still against our EULA and that’s the way it’ll stay.</p>\n<p>But overall you could argue that EVE, or any game for that matter, has a degree of chance built into it. I think we also see form how often this creeps up that there is a big audience wanting to explore the topic. We do take notice of that and are thinking of ways which channel that productively and within the principles of EVE.</p>\n<h2><strong>Rename certificates. You had in the Chinese server, any chance to get here? Off course you get a paid service and an history.</strong></h2>\n<p>This is something we’ve been considering for a while, especially when we’re in a position where players can buy and sell characters.</p>\n<p>It’s not something that’s on a roadmap right now, but we’re looking at character services and what we can add to the New Eden Store in future, so there’s every chance this’ll become a thing some day!</p>\n<p>Putting your old name on the employment history, which has often been suggested by the community is for example a great example of a design to address some of the issues name changes bring in a world like EVE.</p>\n<h2><strong>Could the EVE castor mile stone client (2003?) be brought out of mothballs for occasions for historical showcases?</strong></h2>\n<p>We tried to do this for the 10th anniversary celebration, but due to differences in software and sever architecture the oldest client we could get working was around Red Moon Rising.</p>\n<p>You all need to remember that when New Eden first opened its doors to capsuleers, it was running on a bunch of servers powered by Pentium 4 Processors. These days, your cellphone has more processing power than the CPU that was running a fleet fight back then.</p>\n<p>Already the builds I am playing of EVE Echoes outshine Castor. I also often go and play again old games and watch old movies and rarely do they hold up to my memory of them. I think replaying Castor 16 years later might do more harm than good.</p>\n<h2><strong>What is the vision for the game? Is there some sort of a tentative long-term roadmap that CCP could share with the player base?</strong></h2>\n<p>2019 is all about strengthening the core of the game, with cleanup of old systems and the transition to DirectX 12 and 64-bit. Also, we are improving our internal tools to increase velocity of our dev teams. We are also pushing to fix some of the “broken windows” we have in EVE, especially in the first 30 days, as we have over 10.000 new players every week going through those.</p>\n<p>We want to focus on that right now to strengthen the foundations of EVE, including improvement to EVE’s overall game balance, then we’ll be ready to talk about more long-term plans.</p>\n<p>There is a roadmap of course, we just want to make sure that we’re focused on addressing the community’s concerns in the present, here and now, before we start talking about grand plans and long-term vision.</p>\n<h2><strong>Does CCP realize that by default, the better they support multiboxing and AFK activities, the better they support bots due to bots using those particular mechanics to a much greater extent? Is CCP happy with the number and extent of AFK and multi boxed activities in the game?</strong></h2>\n<p>The way that EVE has evolved over the years means that it caters to those who want to min/max heavily, and of course that means people running multiple accounts.</p>\n<p>While we hear of people who run hundreds of accounts, the average is still somewhere around 1.6 accounts per human.</p>\n<p>We’ve been pretty clear about multiboxing and multiplexing in the past and our policies on them haven’t changed.</p>\n<h2><strong>What are CCPs plans to deal with things such as SP farms?</strong></h2>\n<p>It depends what you mean by “deal with” really. There’s no rule against someone operating 200 accounts, so long as they’re not using them to multiplex.</p>\n<p>SP farms are something that we (in particular the EVE Economic Council) are keeping a very close eye on, and if changes need to be made for the health of the game then we’ll look at what we can do to make it happen.</p>\n<h2><strong>Do you consider introducing skill injectors beneficial to longevity and overall health of the game?</strong></h2>\n<p>Yep, 100%. They’ve opened the doors for new players to skill up quickly and have at least partially broken down the mentality of “I want to play EVE but I’m always going to be 10 years in skillpoints behind the guys who’ve been playing for ages”.</p>\n<p>They also, like PLEX, adhere to the mantra of increasing player choice in how to manage time and money investment in the game. We think it’s very important for games overall to balance this and balance it both ways.</p>\n<h2><strong>Do you even play?</strong></h2>\n<p>Yep, actively and on multiple accounts, but I’m not going to tell you what I do.</p>\n<p>CCP Rise did that one time, he described a single fight he had with a guy and it took someone 30 minutes to track down his character and EVEmail him.</p>\n<p>I like my anonymity in game and I don’t want you guys going all CSI: Jita on me.</p>\n<h2><strong>Is there any plans to intervene in the price of PLEX?</strong></h2>\n<p>There are no plans to do so that this stage, but the EVE Economic Council is watching the situation closely. If they feel there’s need to intervene, then we’ll look at how to do so.</p>\n<p>If you look at it at the core then it’s more the price of ISK which is falling, rather than PLEX rising. The ease of which segments of EVE Players are able to generate new ISK into the economy, often without any risk or exposure to other players interfering is the crusp of the issue IMHO.</p>\n<h2><strong>Do we have any plans to implement a distributed game engine like the Aether engine and what would a conservative time-frame for that?</strong></h2>\n<p>We have a commitment in addressing some of the fundamental tech foundation of EVE. Not only 64 bit clients and DirectX12 but also the physics engine Destiny – which actually is distributed in some understanding of the concept. Something like the Æther engine would enable us to address some of the short cuts we took back in 2002 when Destiny was created. Things like ship orientation and line of sight occlusion for shots and lasers are hard or expensive to do in Destiny and as a result combat in EVE becomes one dimensional. It will take years to address these things but the journey has started. Too soon to talk about timelines but every step informs, so please join in both fleet fight tests on current tech and scale test of future tests. This helps us deliver on our ambition of EVE Forever, we can not get there alone.</p>\n<h2><strong>What have you learned from Pearl Abyss so far and what more can we expect?</strong></h2>\n<p>We’ve learned that it’s incredible for CCP to be owned by a gaming company that also loves games rather than a consortium of financial investors whose main objective is profit. It’s amazing to be working with a group that are the same as us – a big pile of nerds who love making video games.</p>\n<p>CCP and Pearl Abyss are already collaborating and knowledge sharing. What the EVE Community can expect out of the new relationship is far more stability for CCP, more long-term planning and of course a bright future for the EVE Universe.</p>\n<h2><strong>Can we please have capitals be disabled in Low sec so that Low sec alliances/corps can actually have some autonomy?</strong></h2>\n<p>I think no one disagrees that lowsec is an area of the game that could use a little more love. Right now, our focus is elsewhere, but I’m sure we’ll start to look at it as we work through a list of areas of EVE that need some attention.</p>\n<h2><strong>I enjoyed being able to walk around with my character in a station, it added some flavour and immersion to the game. Will we be able to do something similar in the future?</strong></h2>\n<p>You and me both, I loved it too! Never say never. We recognize that character-based gameplay in the EVE Universe was a popular concept among EVE’s playerbase and it remains a very compelling idea for us too. We’ve been exploring this with Project Nova and various other small projects.</p>\n<p>We don’t have any information to share right now, but it’s something we still hold out hopes to develop further at some point in the not-too-distant future. After all, the future is a long time and EVE is forever.</p>\n<h2><strong>Why go with Hadean over an established distributed computing company like <a href=\"http://Improbable.io\" rel=\"nofollow noopener\">Improbable.io</a>?</strong></h2>\n<p>Like the relationship with Pearl Abyss, CCP always looks for partners who share our culture and our loves for games. Hadean are also an awesome group of nerds who’re doing amazing things, so the fit felt right and logical.</p>\n<p>They’ve also demonstrated their capability in their field many times over, so we made the decision to work with them based on this.</p>\n<h2><strong>Could we have an update on the fate/progress of CCP’s other projects? Particularly Eve: Nova and Eve: War of Ascension?</strong></h2>\n<p>We’ve taken Project Nova back into incubation where it continues to evolve. Rest assured, we remain committed to providing a rock-solid, integrated gameplay experience set in the EVE IP with stellar visuals to match.</p>\n<p>Development of War of Ascension has been brought internally and we’re currently exploring next steps. We’re still thrilled with the response to the game WoA received from its players in Phase One and we hope to have more to tell you later this year.</p>\n<p>EVE Echoes is currently in full speed development between us and NetEase.</p>\n<h2><strong>EVE started off as a hardcore game with a HTFU attitude. Do you feel the game is still as hardcore as when it started and are you happy with the current direction of EVE.</strong></h2>\n<p>Grab your most expensive ship and head for the borders of lowsec and nullsec, then ask yourself that question again when you wake up in a vat with a headache.</p>\n<p>EVE will always be dark, gritty and harsh, that’s how it was built. We want it to stay savage and cut throat, but at the same time we need to recognize that for new players to survive we need to reduce the monolithic nature of some of our game systems.</p>\n<p>EVE doesn’t need to lose the depth that we’ve all come to know and love, it just needs to become a little more accessible to a new generation of gamers who play differently to us old-school nerds.</p>\n<p>A lot of this is about maintaining depth and separating out good complexity and bad complexity. EVE has a lot of bad complexity, here is a great article I refer to a lot internally:</p>\n<aside class=\"onebox whitelistedgeneric\">\n  <header class=\"source\">\n      <a href=\"http://www.gamasutra.com/blogs/DanFelder/20150521/243962/Design_101_Complexity_vs_Depth.php\" target=\"_blank\" rel=\"nofollow noopener\">gamasutra.com</a>\n  </header>\n  <article class=\"onebox-body\">\n    <img src=\"https://discourse-cdn-sjc1.com/eveonline/uploads/default/original/3X/a/f/afcea8b303b94225bbbbad25a22b8ae367bead4e.jpeg\" class=\"thumbnail onebox-avatar\" width=\"128\" height=\"128\">\n\n<h3><a href=\"http://www.gamasutra.com/blogs/DanFelder/20150521/243962/Design_101_Complexity_vs_Depth.php\" target=\"_blank\" rel=\"nofollow noopener\">Design 101: Complexity vs. Depth</a></h3>\n\n<p>It's one of the most controversial topics in game design, and it's all a big misunderstanding.</p>\n\n\n  </article>\n  <div class=\"onebox-metadata\">\n    \n    \n  </div>\n  <div style=\"clear: both\"></div>\n</aside>\n\n<h2><strong>What do you think that is the largest challenge that EVE Online is facing in terms of player demography (how many people play and how long)?</strong></h2>\n<p>The biggest challenge that EVE faces right now is around new player onboarding and retention, which is something we’re trying to work on.</p>\n<p>That’s why you guys have seen a lot of activity around the NPE, as well as projects like Skills on Demand and the introduction of Alpha Clones. It’s all about improving accessibility and onboarding, but at the same time remaining true to the core vision for the EVE Universe.</p>\n<p>Every week we have over 10.000 new EVE Players and 30 days later not very many remain. This needs to change.</p>\n<h2><strong>Are you ever going to do anything about freighter bumping in hisec? It produces stale gank farming where multi-boxing gankers can stack up ganks. There is no fun at all for the freighter pilot, and they can be bumped for hours.</strong></h2>\n<p>Bumping is something that gets discussed quite a bit at CCP and it’s always going to be a double-edged blade when it comes to discussion.</p>\n<p>There are no plans to look at changes to destiny (EVE’s physics engine) right now, but we may look at doing so in future as EVE grows and evolves with new technology.</p>\n<h2><strong>Years ago you talked about a TV series what happened to this?</strong></h2>\n<p>We had ambitious plans for this, but right now we’re focusing on being a video games company and are working hardcore to prepare EVE for the third decade.</p>\n<p>Don’t worry though, we still have plans and the fire is still very much burning in terms of wanting to bring New Eden to the silver screen. Nothing to reveal right now, but we’ll see what the future brings.</p>\n<h2><strong>What single business decision that you’ve made for CCP would you take back if you could, and how would you have done it differently knowing what you know now? (Challenge: please pick something other than the response to the monocle protests… too long ago)</strong></h2>\n<p>CCP grew too fast during the years 2008 – 2010, I should have shown more patience and pace.</p>\n<h2><strong>Please can we have a realistic EU CCP approved supplier for EVE IP items - like hoodies, glasses and mugs. Europe is a good market place, but we are NOT mugs for paying US postage charges.</strong></h2>\n<p>Our brand and business development teams are acutely aware of shipping concerns from the EVE Store in the US.</p>\n<p>Right now, we don’t have any plans to expand store operations as we simply don’t meet the volume of sales that are needed for a partnership with a larger supplier of swag.</p>\n<h2><strong>Can we get an update on Project Discovery, and the future of this type of mini-game?</strong></h2>\n<p>You guys are still pounding away at exoplanet discovery and providing reams of data! I personally just crossed over 95% accuracy rating and love doing it. Mining in EVE, doing Project Discovery and listening to science podcasts is my favorite meditation activity.</p>\n<p>We don’t have anything to announce regarding a next phase for Project Discovery right now. Once we do, we’ll let you guys know.</p>\n<h2><strong>When will we see a CSM that does a better job of representing the player base?</strong></h2>\n<p>The CSM represents the players who vote for them, just the same as any other democratically elected body.</p>\n<p>If you don’t like what they’re doing or if you feel like they’re not representing your interests, start campaigning!</p>\n<p>As I am sure we can all observe in the world today, democracy is hard!</p>\n<h2><strong>Are you fearless?</strong></h2>\n<p>Yep, unless the topic is big hairy spiders. Then I’m afraid it’s a no. I am somewhat dreading going to EDU for this reason.</p>\n<h2><strong>I will be flying to Norway at the beginning of May. Could CCP Hellmar please ensure Eyjafjallajökull does not interrupt the flight.</strong></h2>\n<p>You should be more worried about Katla and Hekla rather than Eyjafjallajökull. Those are the ones that have been doing the most rumbling recently.</p>\n<h2><strong>Besides the recent changes to wardec mechanics, what else is being done to improve new player retention?</strong></h2>\n<p>We’re always looking at ways to improve new player retention. There’s been a lot of work on the NPE, as well as projects like Skills On Demand. We also have a few UI/UX changes in the works too that should break down the barrier a little, and of course we’re always open to community suggestions too!</p>\n<h2><strong>Are there any plans to make Battleships more viable?</strong></h2>\n<p>The EVE Dev Team released a blog a couple of weeks ago detailing some of the first balance changes of 2019 that are coming over the course of the next few releases.</p>\n<p>While we can’t promise anything right now, there’ll more than likely be a look at some other popular ships and ship classes once this first round of balance changes has been shipped.</p>\n<h2><strong>The important question: Cat ears for our avatar when? Also a question based on Pearl Abyss’ Black Desert Online: jiggle physics when?</strong></h2>\n<p>We have no plans to introduce cat ears to EVE, however if we did it would make sense that you could only have them if you were Gallente, given bodymodding culture.</p>\n<p>With regards to the second part of your questions, please delete your browser history and go outside more.</p>\n<h2><strong>What did you mean with “Hold my beer?”</strong></h2>\n<p>“My beer, please hold it…”</p>\n<h2><strong>Were you in the Aether Wars test? Did you get many kills?</strong></h2>\n<p>I was not in the test, but I was in the Hadean booth with all the Hadean peeps watching the stream!</p>\n<p>We’ve been doing a lot of testing internally too though and I’ve been kicking people’s asses.</p>", "username": "CCP_Falcon", "name": "CCP Falcon", "likes": 9, "id": 895269, "postedDate": 1553781213000}, "3": {"body": "<p>Alright, let the questions begin!</p>\n<p><img src=\"https://discourse-cdn-sjc1.com/eveonline/images/emoji/twitter/smiley.png?v=6\" title=\":smiley:\" class=\"emoji\" alt=\":smiley:\"></p>", "username": "CCP_Falcon", "name": "CCP Falcon", "likes": 3, "id": 895271, "postedDate": 1553781244000}, "5": {"body": "<p>We have never allowed supers in highsec</p>", "username": "CCP_Hellmar", "name": "CCP Hellmar", "likes": 4, "reply": {"body": "<p>Will CCp ever allow supers abck in high-sec?</p>", "username": "Wavemistress_Moidel", "name": "Wavemistress Moidel", "likes": 0, "id": 895285, "postedDate": 1553781860000}, "id": 895288, "postedDate": 1553781907000}, "10": {"body": "<p>EVE is about creating beautiful things and then destroying them. Sounds like the balance is a bit of if they are proliferating to this extent. Maybe it´s something we will look at in the future if the proliferation continues at this rate.</p>", "username": "CCP_Hellmar", "name": "CCP Hellmar", "likes": 0, "reply": {"body": "<p>do you think its fine having 40+ keepstars in 1 region</p>\n<p>at hellmar sry</p>", "username": "sheshi_Shaishi", "name": "sheshi Shaishi", "likes": 0, "id": 895293, "postedDate": 1553782167000}, "id": 895298, "postedDate": 1553782290000}, "11": {"body": "<p>If we figure out the risk reward dynamics then we will.</p>", "username": "CCP_Hellmar", "name": "CCP Hellmar", "likes": 0, "reply": {"body": "<p>Will CCP bring back lvl 5 missions to high-sec or has that horse been flogged to death as well? <img src=\"https://discourse-cdn-sjc1.com/eveonline/images/emoji/twitter/slight_smile.png?v=6\" title=\":slight_smile:\" class=\"emoji\" alt=\":slight_smile:\"></p>", "username": "Wavemistress_Moidel", "name": "Wavemistress Moidel", "likes": 0, "id": 895294, "postedDate": 1553782228000}, "id": 895300, "postedDate": 1553782330000}, "13": {"body": "<p>Asking for a friend,</p>\n<p>Pineapple on pizza, yay or nay?</p>", "username": "ISD_Dorrim_Barstorlode", "name": "ISD Dorrim Barstorlode", "likes": 6, "id": 895303, "postedDate": 1553782350000}, "20": {"body": "<p>I think wormholes are as close to the origins of EVE as can be. Frankly a big part of EVE back in the day was about 3rd party tools to cope with the cruelty of EVE. I am not sure I would want to change that but often we have coopeted features from 3rd party tool into the core experience but that´s not a big priority right now.   wormholer BTW</p>", "username": "CCP_Hellmar", "name": "CCP Hellmar", "likes": 2, "reply": {"body": "<p>Wormholes are held in high regard as a good standard for gameplay in EVE. Is there any thought internally about building in-game tools to help with Wormhole life, to make wormholes livable without a slate of third party tools? (Tripwire, mass calculators, etc)</p>", "username": "Jask_Askari", "name": "Jask Askari", "likes": 1, "id": 895295, "postedDate": 1553782262000}, "id": 895312, "postedDate": 1553782562000}, "21": {"body": "<p>I agree, it would be a shame. Your question makes me want to check for a leak.</p>", "username": "CCP_Hellmar", "name": "CCP Hellmar", "likes": 2, "reply": {"body": "<p>Would it be to possible to salvage “project nova” into a form of WiS? Would be a shame to let all the graphic-assets of ship interiors go to Bit-Valhalla. And development with an standard market engine should be a lot easier then with the self developed carbon engine.</p>\n<p>Or what are your plans with project nova?</p>", "username": "Rovinia", "name": "Rovinia", "likes": 1, "id": 895302, "postedDate": 1553782349000}, "id": 895314, "postedDate": 1553782630000}, "22": {"body": "<p>I agree.</p>", "username": "CCP_Hellmar", "name": "CCP Hellmar", "likes": 0, "reply": {"body": "<p>game doesnt need more easy safer ways to make isk</p>", "username": "sheshi_Shaishi", "name": "sheshi Shaishi", "likes": 0, "id": 895297, "postedDate": 1553782286000}, "id": 895315, "postedDate": 1553782660000}, "24": {"body": "<aside class=\"quote group-ISD\" data-post=\"13\" data-topic=\"149100\" data-full=\"true\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img alt width=\"20\" height=\"20\" src=\"https://discourse-cdn-sjc1.com/eveonline/user_avatar/forums.eveonline.com/isd_dorrim_barstorlode/40/100328_2.png\" class=\"avatar\"> ISD_Dorrim_Barstorlode:</div>\n<blockquote>\n<p>Asking for a friend,</p>\n<p>Pineapple on pizza, yay or nay?</p>\n</blockquote>\n</aside>\n<p>yay but I changed my mind and now it´s a no.<br>\nI actually ran a pizza place in Mosfellsbær when I was at University.</p>", "username": "CCP_Hellmar", "name": "CCP Hellmar", "likes": 5, "reply": {"body": "<p>Asking for a friend,</p>\n<p>Pineapple on pizza, yay or nay?</p>", "username": "ISD_Dorrim_Barstorlode", "name": "ISD Dorrim Barstorlode", "likes": 6, "id": 895303, "postedDate": 1553782350000}, "id": 895319, "postedDate": 1553782765000}, "26": {"body": "<p>Drifters, no question. First time I saw a drifter, I ■■■■ my pants - just a little bit.</p>", "username": "CCP_Hellmar", "name": "CCP Hellmar", "likes": 4, "reply": {"body": "<p>Of all the precursor factions (Drifters, Triglavians, Yan Jung, Talocan etc.), and without any spoilers, which one is your favorite &amp; why?</p>\n<p>The many factions of EVE have a lot of fantastic creativity attached to them, that’s definitely what caught my eye and made me fall in love with the EVE universe~</p>", "username": "Uriel_Paradisi_Anteovnuecci", "name": "Uriel Paradisi Anteovnuecci", "likes": 2, "id": 895305, "postedDate": 1553782388000}, "id": 895323, "postedDate": 1553782840000}, "27": {"body": "<p>Not realizing multiple cores in a CPU would be a thing.</p>", "username": "CCP_Hellmar", "name": "CCP Hellmar", "likes": 5, "reply": {"body": "<p>CCP Hellmar, In making EVE what was your worst decision?</p>", "username": "KIli_Daran", "name": "KIli Daran", "likes": 1, "id": 895306, "postedDate": 1553782394000}, "id": 895324, "postedDate": 1553782869000}, "28": {"body": "<p>I, like you are very interesting in timetravel, it´s such a scifi thing. latest research into the matter seems to indicate we could actually travel back and change the timeline. I think that´s actually simpler than figuring out how to roll back the code.</p>", "username": "CCP_Hellmar", "name": "CCP Hellmar", "likes": 5, "reply": {"body": "<p>When are you going to rollback to 2012 so the game will be good?</p>", "username": "theRaptor", "name": "theRaptor", "likes": 0, "id": 895307, "postedDate": 1553782396000}, "id": 895326, "postedDate": 1553782951000}, "33": {"body": "<p>The Hadean tech is applicable to many cases in gaming. It´s actually quite similar to an architecture proposal we created at CCP back in 2013. The first step is more about simulation games like EVE where the user input is not very twitchy. FPSs are more a networking data distro problem than a simulation problem. It could eventually be applied to that but games like EVE are the low hanging fruit.</p>", "username": "CCP_Hellmar", "name": "CCP Hellmar", "likes": 2, "reply": {"body": "<p>Hey!</p>\n<p>Is there a potential to use Hadean technology for improving Project Nova gameplay, for example getting rid of the 16v16 restriction (or 4 co-op) in player matches, or making it possible to roam planets, supporting massive counts of player avatars at one place?</p>\n<p>Speaking of avatars, do you feel like Avatar Gameplay, WiS style plus more, is a natural step for the future, to be implemented in Nova or in another segment (project) in the EVE universe?</p>\n<p><img src=\"https://discourse-cdn-sjc1.com/eveonline/images/emoji/twitter/beer.png?v=6\" title=\":beer:\" class=\"emoji\" alt=\":beer:\"></p>", "username": "Veskin_Sentinel", "name": "Veskin Sentinel", "likes": 0, "id": 895310, "postedDate": 1553782507000}, "id": 895335, "postedDate": 1553783078000}, "37": {"body": "<p>No one to my knowledge has asked for this. Now that you have, a seed has been planted.</p>", "username": "CCP_Hellmar", "name": "CCP Hellmar", "likes": 2, "reply": {"body": "<p>Considering the game has over 300 Keybindings,  will CCP Ever give EVE Online support for more input devices such as game controllers or button boxes?</p>", "username": "Abathur_Warfield", "name": "Abathur Warfield", "likes": 0, "id": 895311, "postedDate": 1553782553000}, "id": 895341, "postedDate": 1553783165000}, "42": {"body": "<p>Capitals are T1.</p>", "username": "CCP_Hellmar", "name": "CCP Hellmar", "likes": 0, "reply": {"body": "<p>How would you justify capitals getting over two times better insurance than T2 ships?</p>", "username": "Thrashy_Dumpster", "name": "Thrashy Dumpster", "likes": 0, "id": 895318, "postedDate": 1553782735000}, "id": 895347, "postedDate": 1553783205000}, "44": {"body": "<p>I think the situation with the ISK economy is out of control. There are too many ways to create risk free ISK income streams. See reply above as well.</p>", "username": "CCP_Hellmar", "name": "CCP Hellmar", "likes": 5, "reply": {"body": "<p>How do you feel about inflation within the game and specifically with the price of PLEX.</p>", "username": "Jaiden_Solo", "name": "Jaiden Solo", "likes": 0, "id": 895320, "postedDate": 1553782804000}, "id": 895350, "postedDate": 1553783270000}, "49": {"body": "<p>Some of this is answered above.</p>\n<p>EVE´s problem is actually not attracting new players. We get over 10.000 new players trying to play every week. 30 days later not very remain. We have also experimented in getting more players to go into our funnel and we can do that with relative ease.</p>\n<p>The issues is onboarding and we will be doing a lot on that front this year.</p>\n<p>you idea about mission escalations is an interesting one.</p>", "username": "CCP_Hellmar", "name": "CCP Hellmar", "likes": 3, "reply": {"body": "<p>With the Korean localisation coming, and the opportunities for reaching new players though working with Pearl Abyss I am curious about the following things.</p>\n<p>Can you tell us about the marketing plans / strategies for attracting new players?</p>\n<p>Which opportunities have arisen due to working with Pearl Abyss? Are there synergies?</p>\n<p>The Fleet finder function in the new agency looks very promising for getting new players engaged. What is the strategy for making it easier to find the social connection in eve?</p>\n<p>Would it be possible to add escalations to the missions in your overview?</p>\n<p>Fly safe Capsuleer o7</p>", "username": "Gitzo_Gutface", "name": "Gitzo Gutface", "likes": 0, "id": 895327, "postedDate": 1553782952000}, "id": 895359, "postedDate": 1553783462000}, "52": {"body": "<p>The idea with the Abyssal tech is to create an experimental kitchen of sorts to try things which are hard to do in the main game. Then once we have stabilized and fully understood the dynamics, to bring them into the main game. So what you are asking about is an example of that general strategy.</p>", "username": "CCP_Hellmar", "name": "CCP Hellmar", "likes": 4, "reply": {"body": "<p>Has there been any thoughts of applying the coding for Abyssal Space filaments and the content are generated for each one and reworking it a bit to be used to generate new missions as well as new exploration sites?</p>", "username": "Buoytender_Bob", "name": "Buoytender Bob", "likes": 2, "id": 895330, "postedDate": 1553782985000}, "id": 895367, "postedDate": 1553783563000}, "56": {"body": "<p>Your EVE-fu is beyond me. The dev team (the professionals) is taking a look at Rorqual changes. We are making once balance pass, if more is needed in the future, we will do more.</p>", "username": "CCP_Hellmar", "name": "CCP Hellmar", "likes": 0, "reply": {"body": "<p>Do you think making panic only apply to sub caps on grid instead of the rorqual would be good as the rorq already has tank that rivals that of a fax even after the coming nerf</p>\n<p>would allow dreadbombs under the umbrella to work more often</p>", "username": "sheshi_Shaishi", "name": "sheshi Shaishi", "likes": 0, "id": 895331, "postedDate": 1553782990000}, "id": 895376, "postedDate": 1553783675000}, "59": {"body": "<p>We are always looking for ways to help new players onboard into the amazing world we have created together. If you have some specific ideas, I would love to hear about them.</p>", "username": "CCP_Hellmar", "name": "CCP Hellmar", "likes": 0, "reply": {"body": "<p>You’ve nerfed a lot over the years, apparently without realizing. Many psychological barriers have been implemented, which ultimately hurt especially new players from potentially interacting with others.</p>\n<p>Will you re-introduce more/old ways of interaction between pilots in highsec, to increase the change of people meeting and creating friends randomly, naturally, organically, instead of trying to artificially cause these situations?</p>\n<p>Talking about highsec!</p>", "username": "Solecist_Project", "name": "Solecist Project", "likes": 0, "id": 895332, "postedDate": 1553783027000}, "id": 895381, "postedDate": 1553783798000}, "62": {"body": "<p>We have taken a look at that. Right now UE4 is not ready for EVE, our Trinity engine is a highly specialized engine for running spaceships and space scenes. We have fed back to Epic what needs to change and it´s on their roadmap but currently not with high priority. Hopefully in the future we can take a look again but in the mean time we are investing in our own engine.</p>", "username": "CCP_Hellmar", "name": "CCP Hellmar", "likes": 2, "reply": {"body": "<p>With past titles like Valkyire, Gunjack, Nova and Dust been based on the Unreal engine. Have you ever thought about moving EVE over to Unreal as well?</p>", "username": "KIli_Daran", "name": "KIli Daran", "likes": 1, "id": 895336, "postedDate": 1553783085000}, "id": 895384, "postedDate": 1553783906000}, "63": {"body": "<p>Our CS team pushes a lot for changes to this. We meet with them regularly and this is one of the top items on their list. You feedback here I will take into those meetings and hopefully we will be able to put a higher priority on addressing this.</p>", "username": "CCP_Hellmar", "name": "CCP Hellmar", "likes": 2, "reply": {"body": "<p>Thanks for the answer on bumping of freighters in hisec.    Without that I think that ganking is pretty balanced in hisec.   The issue I have with it is that the hisec player who is casual and has one account maybe two is not able to counter it, which is especially poor in terms of the fact that he is being held in place with an act that produces no consequences.    I understand that consequences for that would be a bad idea.</p>\n<p>What I have come to now as a possible way to keep this in is that an option you should look at is enabling fitting on freighters like you can with the Bowhead.</p>\n<p>One of the major issues I see with this bumping mechanic is that it makes moving stuff around hisec a chore and you don’t really get much benefit for actually being at your ships controls as compared to AFK, apart from docking up and logging.</p>\n<p>I hope you do a war dec like check on this, because many players I spoke to who had been bumped blamed CCP for the poor mechanics and that is not good in terms of players deciding to stay after a loss.</p>", "username": "Dracvlad", "name": "Dracvlad", "likes": 3, "id": 895338, "postedDate": 1553783103000}, "id": 895385, "postedDate": 1553784008000}, "65": {"body": "<p>Our agent system is a product of a decade ago or so, it limits what we can do. We have discussed putting resources in modernizing the system and that will open up a new push for giving our backstory and pve content some well deserved love. Especially as this is basically our first 30 days of EVE.</p>", "username": "CCP_Hellmar", "name": "CCP Hellmar", "likes": 8, "reply": {"body": "<p>Society of Conscious Thought, InterBUS, etc.   Any chance that we will see a return of agents? LP store and more?  Plase</p>", "username": "Atij_Remmacs", "name": "Atij Remmacs", "likes": 2, "id": 895339, "postedDate": 1553783138000}, "id": 895388, "postedDate": 1553784121000}, "68": {"body": "<p>the ability create a risk free income stream once you have secured a particular territory under the SOV system needs to be aligned to risk reward dynamics in EVE as we would like to see them.</p>", "username": "CCP_Hellmar", "name": "CCP Hellmar", "likes": 4, "reply": {"body": "<p>Since 2019 is pretty much dedicated to improve the technical base of EVE and also balancing the game, I would like to know which section of EVE needs the most effort in order to keep everything balanced in your opinion.</p>", "username": "Spacepilot101", "name": "Spacepilot101", "likes": 3, "id": 895345, "postedDate": 1553783190000}, "id": 895392, "postedDate": 1553784232000}, "72": {"body": "<p>We have discussed experimenting with having DT every other day this year as an experiment to see what holes we need to plug and systems to update. <a class=\"mention\" href=\"/u/ccp_explorer\">@CCP_Explorer</a> is super passionate about this and I share his passion.</p>", "username": "CCP_Hellmar", "name": "CCP Hellmar", "likes": 1, "reply": {"body": "<p>With all this alleged hype about new tech on the current development path to improve performance, will this have any impact on the daily downtime in the future?<br>\nIf so, for example, less frequent than a day or maybe a complete removal or atleast something to prevent the 100% security of assets in space upon cluster shutdown?</p>", "username": "Kain_Bastage", "name": "Kain Bastage", "likes": 0, "id": 895346, "postedDate": 1553783202000}, "id": 895398, "postedDate": 1553784342000}, "73": {"body": "<p>It´s such a nice use case that we have many things to do before we do something like that.</p>", "username": "CCP_Hellmar", "name": "CCP Hellmar", "likes": 0, "reply": {"body": "<p>Will the Eve client ever have the multi-boxing perks of core assignment and the small windows that select character screen like the third party apps like ISBoxer?</p>", "username": "Shiroe_Kumamato", "name": "Shiroe Kumamato", "likes": 0, "id": 895349, "postedDate": 1553783232000}, "id": 895399, "postedDate": 1553784410000}, "76": {"body": "<p>A lot more needs to be done about the tutorial and right now we are working on something which are more of a mix between “Inception” and “Brave New NPE”. There was a lot of stuff I personally loved about Inception but it was very hard to maintain and develop further so we had to take one step back before we can take two steps forwards.</p>", "username": "CCP_Hellmar", "name": "CCP Hellmar", "likes": 2, "reply": {"body": "<p>What are your thoughts on the current iteration of the game’s tutorial, and how much has it helped new players in comparison to the tutorials in the past?</p>\n<p>Do you feel as though more could be done to flesh out the tutorial to cover areas that it and agents do not, or do you feel as though that kind of information is better left for the player to discover/learn from other players?</p>", "username": "Taloris_Aldercain", "name": "Taloris Aldercain", "likes": 0, "id": 895352, "postedDate": 1553783316000}, "id": 895406, "postedDate": 1553784514000}, "79": {"body": "<p>We are dedicating resources to tools and work environment improvements to our developers. We have also build up a data and strategic analysis team to make better informed decisions about where to focus our efforts. That team for example was key in identifying with clarity the issues around the wardeck bulling.</p>", "username": "CCP_Hellmar", "name": "CCP Hellmar", "likes": 5, "reply": {"body": "<p>Do you think anything could be done to improve delivery of major system overhauls management-wise? Or do you think the code base is just way too spaghetti to realistically have a chance for faster system iterations?</p>\n<p>I mean, the wardec system has been a problem for many many years now. Only now have we finally come to a point where changes are actually being implemented.</p>\n<p>So when you talk about FW changes/lowsec improvements, is that another way of saying that maybe something will happen in like 8-10 years time?</p>", "username": "Maekchu", "name": "Maekchu", "likes": 1, "id": 895358, "postedDate": 1553783425000}, "id": 895411, "postedDate": 1553784662000}, "82": {"body": "<p>Our whole approach to SKINs, their discovery, etc. needs an overhaul, especially when we are starting to “hit the spot” when it comes to players with SKINs like the caille neon.</p>\n<p>The specific examples your bring up are actually more about not confusing ships by breaking the color palette too much. Like for instance making a Maller the same color as a Sacrilege might confuse new players.</p>", "username": "CCP_Hellmar", "name": "CCP Hellmar", "likes": 2, "reply": {"body": "<p>Hello Hellmar!<br>\nI’m curious what plans you guys have with “basic skins”, ones that involve basic colour pallettes that already exist eg. Khanid, EOM. Why do you guys not release them all in the new eden store? And why do they exist on only certain ships eg Khanid only exists on certain amarr hulls.</p>\n<p>For example EOM skins exist on the navy apoc but not the apoc. Khanid skins exist on the apoc but not the purifier. It would be nice to be able to complete the set and fly the same theme on all my amarr ships, especially considering they already exist on npcs, so I get a bit jelly of them <img src=\"https://discourse-cdn-sjc1.com/eveonline/images/emoji/twitter/stuck_out_tongue.png?v=6\" title=\":stuck_out_tongue:\" class=\"emoji\" alt=\":stuck_out_tongue:\"> Would happily pay big plex for them.</p>", "username": "Aceyfacey", "name": "Aceyfacey", "likes": 0, "id": 895360, "postedDate": 1553783462000}, "id": 895419, "postedDate": 1553784886000}, "84": {"body": "<p>I really don´t know. It´s a very specific game design question <img src=\"https://discourse-cdn-sjc1.com/eveonline/images/emoji/twitter/slight_smile.png?v=6\" title=\":slight_smile:\" class=\"emoji\" alt=\":slight_smile:\"></p>", "username": "CCP_Hellmar", "name": "CCP Hellmar", "likes": 0, "reply": {"body": "<p>Any plans to midgitate the costs of excavator drones?</p>", "username": "AFLACK", "name": "AFLACK", "likes": 0, "id": 895361, "postedDate": 1553783488000}, "id": 895422, "postedDate": 1553784951000}, "85": {"body": "<p>I recently redid the Pirate Epic Mission Arcs in null. I think that is some of the best content we have to nudge new players out of highsec, FW is a similar system. So those systems should get some love to help our new bros.</p>", "username": "CCP_Hellmar", "name": "CCP Hellmar", "likes": 5, "reply": {"body": "<p>Ho Hellmar,</p>\n<p>What is your opinion of the often overlooked parts of the game , e.g wormhole space and FW ?</p>", "username": "teddy_Gbyc", "name": "teddy Gbyc", "likes": 1, "id": 895368, "postedDate": 1553783566000}, "id": 895423, "postedDate": 1553785057000}, "87": {"body": "<p>We plan to continue to develop abyssal space. BS Abyssal sounds like a great thing for the economy <img src=\"https://discourse-cdn-sjc1.com/eveonline/images/emoji/twitter/wink.png?v=6\" title=\":wink:\" class=\"emoji\" alt=\":wink:\"></p>", "username": "CCP_Hellmar", "name": "CCP Hellmar", "likes": 4, "reply": {"body": "<p>Do you guys plan to make more complex abyssal sites? If so how?</p>\n<p>Do you guys plan to release battleship sized abyssal deadspace pockets?</p>", "username": "Aceyfacey", "name": "Aceyfacey", "likes": 2, "id": 895369, "postedDate": 1553783621000}, "id": 895427, "postedDate": 1553785124000}, "90": {"body": "<p>We over did it last year when it came to PLEX promotions. We are going to slow the ■■■■ down for now.</p>\n<p>Thank you for your kind words.</p>", "username": "CCP_Hellmar", "name": "CCP Hellmar", "likes": 1, "reply": {"body": "<p>Hi, thanks for taking the time to interact directly with the community this way.</p>\n<p>You will appreciate that a lot of people have been holding off on purchasing PLEX (for currency) of late, presumeably becuase through the last couple of years, CCP had set a trend for PLEX or Subscription sales at regular intervals.</p>\n<p>Players inevitably see the long delay between the major sales and think “there must be one coming right on the horizon if I wait just a little bit longer”, etc.</p>\n<p>Ultimately your decisions to have those sales will be dictated by the corporate fiscal position and it may well be the case that CCP is in a healthier cash flow position currently, and perhaps want to move away from the subsidised subscription model.</p>\n<p>Do you think there would be merit in setting out specifically if there were no sales planned for long periods of time? In the one sense, it would get people to stop waiting for a sale and just buy some PLEX when they need some ISK (and likewise just sub their accounts rather than wait for the sale to sub for a year at a time, etc).</p>\n<p>Alternatively, a brief message towards the end of a sale period indicating there may not be another one for 3-6 months may help motivate sales too?</p>\n<p>Thanks for your work on the game, especially since the start of this year a lot of us have been seeing a lot more optimism in the smaller communities we are part of, and it’s good to see EVE moving in a positive direction.</p>", "username": "Zeroniss", "name": "Zeroniss", "likes": 2, "id": 895371, "postedDate": 1553783644000}, "id": 895432, "postedDate": 1553785219000}, "91": {"body": "<p>We have the example from China to learn from. The only way for evil to triumph is for good men to do nothing <img src=\"https://discourse-cdn-sjc1.com/eveonline/images/emoji/twitter/wink.png?v=6\" title=\":wink:\" class=\"emoji\" alt=\":wink:\"></p>", "username": "CCP_Hellmar", "name": "CCP Hellmar", "likes": 3, "reply": {"body": "<p>How are you going to keep EVE Alive when one group over runs the server like the PBIC did the China server?</p>", "username": "RothMeer_IronH3art", "name": "RothMeer IronH3art", "likes": 0, "id": 895377, "postedDate": 1553783720000}, "id": 895435, "postedDate": 1553785321000}, "92": {"body": "<p>Me <img src=\"https://discourse-cdn-sjc1.com/eveonline/images/emoji/twitter/grin.png?v=6\" title=\":grin:\" class=\"emoji\" alt=\":grin:\"></p>", "username": "CCP_Hellmar", "name": "CCP Hellmar", "likes": 1, "reply": {"body": "<p>Who do we need to lobby to add Faction Warfare on the Roadmap?</p>", "username": "Sir_Constantin", "name": "Sir Constantin", "likes": 0, "id": 895378, "postedDate": 1553783726000}, "id": 895436, "postedDate": 1553785356000}, "96": {"body": "<p>Hey guys,</p>\n<p>Our hour is up and CCP Hellmar has had to head off to do serious spaceships business stuff.</p>\n<p>Just dropping this post to let you guys know that there won’t be any more immediate responses to questions right now.</p>\n<p>I’ll leave this thread open for a few more hours, then I’ll close it, and we’ll get answers to the rest of the questions in it over the course of the next few days for you guys!</p>\n<p>Thanks for all the questions, awesome stuff! <img src=\"https://discourse-cdn-sjc1.com/eveonline/images/emoji/twitter/heart.png?v=6\" title=\":heart:\" class=\"emoji\" alt=\":heart:\"></p>\n<p>Remember also that CCP Hellmar will be making an appearance on Talking in Stations in an hour or so to chat more about EVE and this AMA.</p>\n<p>Be sure to tune in!</p>", "username": "CCP_Falcon", "name": "CCP Falcon", "likes": 4, "id": 895444, "postedDate": 1553785539000}, "110": {"body": "<p>This topic was automatically closed after 2 hours. New replies are no longer allowed.</p>", "username": "CCP_Falcon", "name": "CCP Falcon", "likes": 0, "id": 895598, "postedDate": 1553796000000}}, "users": {"ISD_Dorrim_Barstorlode": {"title": null, "group": "ISD", "name": "ISD Dorrim Barstorlode", "avatar": "/user_avatar/forums.eveonline.com/isd_dorrim_barstorlode/128/100328_2.png"}, "CCP_Hellmar": {"title": "CEO", "group": "Developers", "name": "CCP Hellmar", "avatar": "/user_avatar/forums.eveonline.com/ccp_hellmar/128/126598_2.png"}, "CCP_Falcon": {"title": "Senior Community Manager", "group": "Developers", "name": "CCP Falcon", "avatar": "/user_avatar/forums.eveonline.com/ccp_falcon/128/11836_2.png"}}, "time": 1553861604893.0}